app/controllers/songs_controller.rb

  def upload
   CSV.foreach(params['file'].path, headers: true) do |artist_song|
     @song = Song.create(title: artist_song[0])
     @artist = Artist.create(name: artist_song[1])
     @song.artist = @artist
     @song.save
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2016-02-07 22:39:04.957665"], ["updated_at", "2016-02-07 22:39:04.957665"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2016-02-07 22:39:04.964280"], ["updated_at", "2016-02-07 22:39:04.964280"]]
UPDATE "songs" SET "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["artist_id", 137], ["updated_at", "2018-04-03 00:57:40.461363"], ["id", 187]]